Revit 2024 API
AnalysisDisplayDiagramSettings.OutlineColor Property
 Color of outline and fence lines in the diagram.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Color OutlineColor { get; set; }
Visual Basic
Public Property OutlineColor As Color
	Get
	Set
Visual C++
public:
property Color^ OutlineColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace